Repository: levndays/muscle_up_android
Catalog: lib/l10n/app_*.arb
Languages: uk

# loginPageSignInButton
source: Sign In
uk: Увійти

# loginPageTitleSignIn
source: Sign In
uk: Вхід

# loginPageTitleSignUp
source: Sign Up
uk: Реєстрація

# loginPageEmailHint
source: Email
uk: Електронна пошта

# loginPagePasswordHint
source: Password
uk: Пароль

# loginPageErrorEnterEmail
source: Please enter your email
uk: Будь ласка, введіть вашу електронну пошту

# loginPageErrorValidEmail
source: Please enter a valid email
uk: Будь ласка, введіть дійсну електронну пошту

# loginPageErrorEnterPassword
source: Please enter your password
uk: Будь ласка, введіть ваш пароль

# loginPageErrorPasswordLength
source: Password must be at least 6 characters
uk: Пароль має містити щонайменше 6 символів

# loginPageButtonCreateAccount
source: Create Account
uk: Створити Обліковий Запис

# loginPageButtonSignInWithGoogle
source: Sign in with Google
uk: Увійти через Google

# loginPageToggleSignUp
source: Don't have an account? Sign Up
uk: Немає облікового запису? Зареєструватися

# loginPageToggleSignIn
source: Already have an account? Sign In
uk: Вже є обліковий запис? Увійти

# loginPageErrorAuthDefault
source: Authentication error occurred.
uk: Сталася помилка автентифікації.

# loginPageErrorUnknownDefault
source: An unknown error occurred: {errorDetails}
uk: Сталася невідома помилка: {errorDetails}

# loginPageErrorGoogleSignInDefault
source: Google Sign-In error.
uk: Помилка входу через Google.

# loginPageErrorUnknownGoogleDefault
source: Unknown Google Sign-In error: {errorDetails}
uk: Невідома помилка під час входу через Google: {errorDetails}

# loginPageErrorInternalForm
source: Internal form error. Please try again.
uk: Внутрішня помилка форми. Будь ласка, спробуйте ще раз.

# profileSetupAppBarTitleEdit
source: Edit Profile
uk: Редагувати Профіль

# profileSetupAppBarTitleCreate
source: Complete Your Profile
uk: Завершіть Ваш Профіль

# profileSetupUsernameLabel
source: Username
uk: Ім'я користувача

# profileSetupUsernameErrorRequired
source: Username is required
uk: Ім'я користувача обов'язкове

# profileSetupDisplayNameLabel
source: Display Name
uk: Відображуване ім'я

# profileSetupGenderLabel
source: Gender
uk: Стать

# profileSetupGenderMale
source: Male
uk: Чоловіча

# profileSetupGenderFemale
source: Female
uk: Жіноча

# profileSetupGenderOther
source: Other
uk: Інша

# profileSetupGenderPreferNotToSay
source: Prefer not to say
uk: Не вказувати

# profileSetupDobLabel
source: Date of Birth
uk: Дата народження

# profileSetupDobDatePickerHelpText
source: Select your date of birth
uk: Оберіть вашу дату народження

# profileSetupHeightLabel
source: Height (cm)
uk: Зріст (см)

# profileSetupHeightErrorInvalid
source: Invalid height (1-300 cm)
uk: Некоректний зріст (1-300 см)

# profileSetupWeightLabel
source: Weight (kg)
uk: Вага (кг)

# profileSetupWeightErrorInvalid
source: Invalid weight (1-500 kg)
uk: Некоректна вага (1-500 кг)

# profileSetupFitnessGoalLabel
source: Primary Fitness Goal
uk: Основна фітнес-ціль

# profileSetupFitnessGoalLoseWeight
source: Lose Weight
uk: Схуднути

# profileSetupFitnessGoalGainMuscle
source: Gain Muscle
uk: Набрати м'язи

# profileSetupFitnessGoalImproveStamina
source: Improve Stamina
uk: Покращити витривалість

# profileSetupFitnessGoalGeneralFitness
source: General Fitness
uk: Загальна фізична форма

# profileSetupFitnessGoalImproveStrength
source: Improve Strength
uk: Покращити силу

# profileSetupActivityLevelLabel
source: Activity Level
uk: Рівень активності

# profileSetupActivityLevelSedentary
source: Sedentary (little or no exercise)
uk: Сидячий (мало або без вправ)

# profileSetupActivityLevelLight
source: Light (exercise 1-3 days/week)
uk: Легкий (вправи 1-3 дні/тиждень)

# profileSetupActivityLevelModerate
source: Moderate (exercise 3-5 days/week)
uk: Помірний (вправи 3-5 днів/тиждень)

# profileSetupActivityLevelActive
source: Active (exercise 6-7 days/week)
uk: Активний (вправи 6-7 днів/тиждень)

# profileSetupActivityLevelVeryActive
source: Very Active (hard exercise or physical job)
uk: Дуже активний (важкі вправи або фізична робота)

# profileSetupButtonSaveChanges
source: Save Changes
uk: Зберегти Зміни

# profileSetupButtonCompleteProfile
source: Complete Profile
uk: Завершити Профіль

# profileSetupErrorUserNotLoggedIn
source: User not logged in.
uk: Користувач не увійшов.

# profileSetupErrorUsernameEmpty
source: Username cannot be empty.
uk: Ім'я користувача не може бути порожнім.

# profileSetupErrorProfileNotFoundEdit
source: Profile to edit not found. Please try again.
uk: Профіль для редагування не знайдено. Будь ласка, спробуйте ще раз.

# profileSetupErrorFailedToLoad
source: Failed to load profile data: {errorDetails}
uk: Не вдалося завантажити дані профілю: {errorDetails}

# profileSetupErrorFailedAvatarUpload
source: Failed to upload avatar image. Profile not saved.
uk: Не вдалося завантажити аватар. Профіль не збережено.

# profileSetupErrorFailedToSave
source: Error: {errorDetails}
uk: Помилка: {errorDetails}

# profileSetupSuccessMessage
source: Profile {status} successfully!
uk: Профіль успішно {status}!

# profileSetupStatusSaved
source: saved
uk: збережено

# profileSetupStatusUpdated
source: updated
uk: оновлено

# profileSetupCorrectFormErrorsSnackbar
source: Please correct the errors in the form.
uk: Будь ласка, виправте помилки у формі.

# profileSetupOptionalFieldSuffix
source: (Optional)
uk: (необов'язково)

# authGateFinalizingAccountSetup
source: Finalizing account setup...
uk: Завершення налаштування облікового запису...

# dashboardGreetingWelcome
source: Welcome,
uk: Вітаємо,

# dashboardSectionStats
source: STATS
uk: СТАТИСТИКА

# dashboardStatsWeightLabel
source: WEIGHT
uk: ВАГА

# dashboardStatsStreakLabel
source: STREAK
uk: СТРІК

# dashboardStatsAdherenceLabel
source: ADHERENCE
uk: ДОТРИМАННЯ

# dashboardSectionNotifications
source: NOTIFICATIONS
uk: СПОВІЩЕННЯ

# dashboardNotificationsReadAll
source: READ ALL
uk: ПРОЧИТАТИ ВСІ

# dashboardNotificationsEmpty
source: No new notifications.
uk: Нових сповіщень немає.

# dashboardNotificationsError
source: Error loading notifications: {message}
uk: Помилка завантаження сповіщень: {message}

# dashboardNotificationsLoading
source: Loading notifications...
uk: Завантаження сповіщень...

# dashboardSnackbarAllNotificationsRead
source: All notifications marked as read!
uk: Усі сповіщення позначено як прочитані!

# upcomingScheduleTitle
source: UPCOMING SCHEDULE (NEXT 7 DAYS)
uk: МАЙБУТНІЙ РОЗКЛАД (НА 7 ДНІВ)

# upcomingScheduleRestDay
source: Rest Day
uk: День відпочинку

# upcomingScheduleError
source: Error: {message}
uk: Помилка: {message}

# upcomingScheduleEmpty
source: No workouts scheduled for the next 7 days.
uk: Немає запланованих тренувань на найближчі 7 днів.

# volumeTrendChartLogWorkouts
source: Log workouts to see your volume trend.
uk: Записуйте тренування, щоб побачити тенденцію об'єму.

# volumeTrendChartLogMoreWorkouts
source: Log at least two workouts to see the trend.
uk: Запишіть щонайменше два тренування, щоб побачити тенденцію.

# volumeTrendChartSingleWorkoutVolume
source: Last workout volume: {volume} k kg. More workouts needed for trend.
uk: Об'єм останнього тренування: {volume} тис. кг. Потрібно більше тренувань для відображення тенденції.

# volumeTrendChartLoading
source: Loading volume data...
uk: Завантаження даних об'єму...

# volumeTrendChartError
source: Error loading volume: {message}
uk: Помилка завантаження об'єму: {message}

# startWorkoutButton
source: START WORKOUT
uk: ПОЧАТИ ТРЕНУВАННЯ

# startWorkoutFabErrorLogin
source: Please log in to start a workout.
uk: Будь ласка, увійдіть, щоб почати тренування.

# startWorkoutFabErrorActiveSession
source: Error checking active session: {errorDetails}
uk: Помилка перевірки активної сесії: {errorDetails}

# startWorkoutFabErrorLoadRoutines
source: Could not load routines. Please try again. Error: {errorDetails}
uk: Не вдалося завантажити розклади. Будь ласка, спробуйте ще раз. Помилка: {errorDetails}

# startWorkoutFabNewRoutineCreatedSnackbar
source: New routine created! Select it from the list to start.
uk: Нову програму створено! Оберіть її зі списку, щоб почати.

# dashboardTabRoutines
source: ROUTINES
uk: ПРОГРАМИ

# dashboardTabExplore
source: EXPLORE
uk: ОГЛЯД

# dashboardTabProgress
source: PROGRESS
uk: ПРОГРЕС

# dashboardTabProfile
source: PROFILE
uk: ПРОФІЛЬ

# userRoutinesScreenTitle
source: My Routines
uk: Мої Програми

# userRoutinesErrorLoad
source: Error loading routines: {message}
uk: Помилка завантаження програм: {message}

# userRoutinesEmptyTitle
source: You have no routines yet.
uk: У вас ще немає програм.

# userRoutinesEmptySubtitle
source: Create a routine to start organizing your workouts!
uk: Створіть програму, щоб почати організовувати свої тренування!

# userRoutinesButtonCreateFirst
source: Create Your First Routine
uk: Створити Першу Програму

# userRoutinesFabNewRoutine
source: NEW ROUTINE
uk: НОВА ПРОГРАМА

# routineListItemMenuStartWorkout
source: Start Workout
uk: Почати Тренування

# routineListItemMenuEditRoutine
source: Edit Routine
uk: Редагувати Програму

# routineListItemMenuShareRoutine
source: Share Routine
uk: Поділитися Програмою

# routineListItemMenuDeleteRoutine
source: Delete Routine
uk: Видалити Програму

# routineListItemDeleteConfirmTitle
source: Confirm Delete
uk: Підтвердити Видалення

# routineListItemDeleteConfirmMessage
source: Are you sure you want to delete "{routineName}"? This action cannot be undone.
uk: Ви впевнені, що хочете видалити "{routineName}"? Цю дію неможливо буде скасувати.

# routineListItemDeleteConfirmButtonCancel
source: Cancel
uk: Скасувати

# routineListItemDeleteConfirmButtonDelete
source: Delete
uk: Видалити

# routineListItemSnackbarDeleted
source: Routine "{routineName}" deleted.
uk: Програму "{routineName}" видалено.

# routineListItemSnackbarErrorDelete
source: Error deleting routine: {errorDetails}
uk: Помилка видалення програми: {errorDetails}

# createEditRoutineScreenTitleEdit
source: Edit Routine
uk: Редагувати Програму

# createEditRoutineScreenTitleCreate
source: Create Routine
uk: Створити Програму

# createEditRoutineTooltipDelete
source: Delete Routine
uk: Видалити Програму

# createEditRoutineSnackbarFormErrors
source: Please correct the errors in the form.
uk: Будь ласка, виправте помилки у формі.

# createEditRoutineErrorMessage
source: Error: {errorDetails}
uk: Помилка: {errorDetails}

# createEditRoutineStatusUpdated
source: Routine updated successfully!
uk: Програму оновлено успішно!

# createEditRoutineStatusCreated
source: Routine created successfully!
uk: Програму створено успішно!

# createEditRoutineStatusDeleted
source: Routine deleted successfully!
uk: Програму видалено успішно!

# createEditRoutineErrorNameEmpty
source: Routine name cannot be empty.
uk: Назва програми не може бути порожньою.

# createEditRoutineErrorNoExercises
source: Routine must have at least one exercise.
uk: Програма повинна містити хоча б одну вправу.

# createEditRoutineErrorDeleteNew
source: Cannot delete a new or unsaved routine.
uk: Неможливо видалити нову або незбережену програму.

# createEditRoutineLoadingMessageSaving
source: Saving routine...
uk: Збереження програми...

# createEditRoutineLoadingMessageDeleting
source: Deleting routine...
uk: Видалення програми...

# createEditRoutineNameLabel
source: Routine Name*
uk: Назва Програми*

# createEditRoutineNameErrorEmpty
source: Name cannot be empty
uk: Назва не може бути порожньою

# createEditRoutineDescriptionLabel
source: Description (optional)
uk: Опис (необов'язково)

# createEditRoutineScheduledDaysLabel
source: Scheduled Days:
uk: Заплановані дні:

# createEditRoutineExercisesLabel
source: Exercises ({count}):
uk: Вправи ({count}):

# createEditRoutineButtonAddExercise
source: Add
uk: Додати

# createEditRoutineNoExercisesPlaceholder
source: No exercises added yet. Tap "Add" to begin.
uk: Ще не додано жодної вправи. Натисніть "Додати", щоб почати.

# createEditRoutineButtonSaveChanges
source: Save Changes
uk: Зберегти Зміни

# createEditRoutineButtonCreateRoutine
source: Create Routine
uk: Створити Програму

# addExerciseDialogTitle
source: Add "{exerciseName}"
uk: Додати "{exerciseName}"

# addExerciseDialogSetsLabel
source: Number of Sets
uk: Кількість підходів

# addExerciseDialogSetsErrorEmpty
source: Cannot be empty
uk: Не може бути порожнім

# addExerciseDialogSetsErrorInvalid
source: Must be a positive number
uk: Має бути позитивним числом

# addExerciseDialogNotesLabel
source: Notes (optional)
uk: Нотатки (необов'язково)

# addExerciseDialogNotesHint
source: E.g., focus on form, pyramid sets
uk: Напр., фокус на формі, пірамідні підходи

# addExerciseDialogButtonCancel
source: Cancel
uk: Скасувати

# addExerciseDialogButtonAdd
source: Add Exercise
uk: Додати Вправу

# editExerciseDialogTitle
source: Edit "{exerciseName}"
uk: Редагувати "{exerciseName}"

# editExerciseDialogButtonUpdate
source: Update
uk: Оновити

# exerciseExplorerScreenTitleSelect
source: Select Exercise
uk: Обрати Вправу

# exerciseExplorerScreenTitleLibrary
source: Exercise Library
uk: Бібліотека Вправ

# exerciseExplorerErrorLoad
source: Error loading exercises: {message}
uk: Помилка завантаження вправ: {message}

# exerciseExplorerEmpty
source: No exercises found in the library yet. Content is being added!
uk: У бібліотеці ще немає вправ. Вміст додається!

# exerciseExplorerButtonTryAgain
source: Try Again
uk: Спробувати Ще Раз

# exerciseExplorerLoading
source: Loading exercises...
uk: Завантаження вправ...

# dashboardButtonSendTestNotifications
source: Send Test Notifications
uk: Надіслати тестові сповіщення

# leagueScreenButtonBackTooltip
source: Back
uk: Назад

# leagueScreenLeaderboardTitle
source: LEADERBOARD
uk: ТАБЛИЦЯ ЛІДЕРІВ

# leagueScreenErrorLoad
source: Error: {errorMessage}
uk: Помилка: {errorMessage}

# leagueScreenNoPlayers
source: No players in this league yet.
uk: У цій лізі ще немає гравців.

# leagueScreenButtonTryAgain
source: Try Again
uk: Спробувати ще

# notificationDetailRelatedInfoTitle
source: Related Information:
uk: Пов'язана інформація:

# notificationDetailRelatedInfoTypeLabel
source: Type:
uk: Тип:

# notificationDetailStatusRead
source: Read
uk: Прочитано

# notificationListItemSnackbarRemoved
source: {notificationTitle} removed.
uk: Сповіщення "{notificationTitle}" видалено.

# notificationListItemSnackbarUndo
source: UNDO
uk: ВІДМІНИТИ

# notificationListItemDismissDelete
source: Delete
uk: Видалити

# profileScreenLogoutConfirmTitle
source: Confirm Logout
uk: Підтвердити вихід

# profileScreenLogoutConfirmMessage
source: Are you sure you want to log out?
uk: Ви впевнені, що хочете вийти?

# profileScreenLogoutConfirmButtonCancel
source: Cancel
uk: Скасувати

# profileScreenLogoutConfirmButtonLogOut
source: Log Out
uk: Вийти

# profileScreenLogoutErrorSnackbar
source: Error logging out: {errorDetails}
uk: Помилка виходу: {errorDetails}

# profileScreenNameFallbackUser
source: User
uk: Користувач

# profileScreenStatLabelFollowers
source: FOLLOWERS
uk: ПІДПИСНИКИ

# profileScreenStatLabelFollowing
source: FOLLOWING
uk: ПІДПИСКИ

# profileScreenStatLabelBestStreak
source: BEST STREAK
uk: КРАЩИЙ СТРІК

# profileScreenStatLabelWeight
source: WEIGHT
uk: ВАГА

# profileScreenUnitKg
source: KG
uk: КГ

# profileScreenGoalLabel
source: GOAL:
uk: ЦІЛЬ:

# profileScreenLastTrainingLabel
source: LAST TRAINING:
uk: ОСТАННЄ ТРЕНУВАННЯ:

# profileScreenRewardsTitle
source: REWARDS
uk: НАГОРОДИ

# profileScreenNoRewards
source: No rewards unlocked yet. Keep training!
uk: Нагород ще не розблоковано. Продовжуйте тренуватися!

# profileScreenMyPostsTitle
source: MY POSTS
uk: МОЇ ДОПИСИ

# profileScreenNoPosts
source: You haven't made any posts yet.
uk: Ви ще не зробили жодного допису.

# profileScreenButtonEditProfile
source: EDIT PROFILE
uk: РЕДАГУВАТИ ПРОФІЛЬ

# profileScreenButtonLogOut
source: LOG OUT
uk: ВИЙТИ

# profileScreenErrorLoadProfile
source: Error loading profile: {errorMessage}
uk: Помилка завантаження профілю: {errorMessage}

# profileScreenErrorUnexpected
source: An unexpected error occurred loading your profile.
uk: Сталася неочікувана помилка під час завантаження вашого профілю.

# createPostScreenLabelPostType
source: Post Type: {postType}
uk: Тип допису: {postType}

# createPostSegmentStandard
source: Standard
uk: Стандартний

# createPostSegmentRoutine
source: Routine
uk: Програма

# createPostSegmentRecord
source: Record
uk: Рекорд

# createPostLabelSharedRoutine
source: Shared Routine:
uk: Поширена програма:

# createPostErrorRoutineUnavailable
source: Routine details unavailable
uk: Деталі програми недоступні

# createPostRoutineExerciseCountSuffix
source: exercises
uk: вправ(и)

# createPostLabelRecordDetailsReadOnly
source: Record Details (Read-only):
uk: Деталі рекорду (тільки для читання):

# createPostLabelRecordExercise
source: Exercise:
uk: Вправа:

# createPostLabelRecordWeight
source: Weight:
uk: Вага:

# createPostUnitKgSuffix
source: kg
uk: кг

# createPostLabelRecordReps
source: Reps:
uk: Повтори:

# createPostLabelRecordVideo
source: Video:
uk: Відео:

# createPostLabelRecordDetails
source: Record Details:
uk: Деталі рекорду:

# createPostHintSelectExercise
source: Select Exercise*
uk: Оберіть вправу*

# createPostHintRecordWeight
source: Weight (kg)*
uk: Вага (кг)*

# createPostErrorRecordWeightInvalid
source: Invalid weight
uk: Некоректна вага

# createPostHintRecordReps
source: Repetitions*
uk: Повторення*

# createPostErrorRecordRepsInvalid
source: Invalid repetitions
uk: Некоректні повторення

# createPostHintRecordVideoUrl
source: Video URL (optional)
uk: URL відео (необов'язково)

# createPostErrorRecordVideoUrlInvalid
source: Enter a valid URL
uk: Введіть дійсний URL

# createPostLabelAttachImageOptionalReplace
source: Attach Image (Optional - Replaces Existing)
uk: Прикріпити зображення (необов'язково - замінить існуюче)

# createPostLabelAttachImageOptional
source: Attach Image (Optional)
uk: Прикріпити зображення (необов'язково)

# createPostButtonAddImage
source: Add Image
uk: Додати зображення

# createPostTooltipRemoveImage
source: Remove Image
uk: Видалити зображення

# createPostTooltipRemoveExistingImage
source: Remove Existing Image
uk: Видалити існуюче зображення

# createPostToggleEnableComments
source: Enable Comments
uk: Увімкнути коментарі

# createPostCommentsEnabledSubtitle
source: Users can comment on this post
uk: Користувачі можуть коментувати цей допис

# createPostCommentsDisabledSubtitle
source: Comments are disabled
uk: Коментарі вимкнені

# createPostHintTextContent
source: What's on your mind?
uk: Що у вас на думці?

# createPostErrorContentOrImageRequired
source: Post content or image is required.
uk: Вміст допису або зображення обов'язкові.

# createPostAppBarTitleEdit
source: Edit Post
uk: Редагувати допис

# createPostAppBarTitleShareRoutine
source: Share Routine
uk: Поділитися програмою

# createPostAppBarTitleCreate
source: Create Post
uk: Створити допис

# createPostButtonSaveChanges
source: Save Changes
uk: Зберегти зміни

# createPostButtonPublish
source: Publish
uk: Опублікувати

# createPostSnackbarSuccess
source: Post {status} successfully!
uk: Допис успішно {status}!

# createPostSnackbarError
source: Error: {errorDetails}
uk: Помилка: {errorDetails}

# createPostStatusUpdated
source: updated
uk: оновлено

# createPostStatusPublished
source: published
uk: опубліковано

# createPostLoadingUpdating
source: Updating post...
uk: Оновлення допису...

# createPostLoadingPublishing
source: Publishing post...
uk: Публікація допису...

# createPostErrorUserNotLoggedIn
source: User not logged in.
uk: Користувач не увійшов.

# createPostErrorContentEmptyStandard
source: Post content cannot be empty for a standard post without media.
uk: Вміст допису не може бути порожнім для стандартного допису без зображення.

# createPostErrorFetchProfile
source: Could not fetch user profile.
uk: Не вдалося отримати профіль користувача.

# createPostErrorUploadMedia
source: Failed to upload media.
uk: Не вдалося завантажити медіа.

# exploreScreenEmptyTitle
source: Nothing to explore yet.
uk: Ще нічого немає.

# exploreScreenEmptySubtitle
source: Be the first to share something!
uk: Будьте першим, хто чимось поділиться!

# exploreScreenErrorLoad
source: Error loading posts: {message}
uk: Помилка завантаження дописів: {message}

# exploreScreenButtonTryAgain
source: Try Again
uk: Спробувати ще

# exploreScreenFabTooltipCreatePost
source: Create Post
uk: Створити допис

# followListScreenTitleFollowers
source: Followers
uk: Підписники

# followListScreenTitleFollowing
source: Following
uk: Підписки

# followListScreenErrorLoad
source: Error: {message}
uk: Помилка: {message}

# followListScreenEmptyFollowers
source: This user has no followers yet.
uk: Цей користувач ще не має підписників.

# followListScreenEmptyFollowing
source: This user is not following anyone yet.
uk: Цей користувач ні на кого не підписаний.

# followListScreenButtonTryAgain
source: Try Again
uk: Спробувати ще

# followListScreenErrorUnexpected
source: Something went wrong.
uk: Щось пішло не так.

# postDetailScreenAppBarTitleFallback
source: Post
uk: Допис

# postDetailMenuEditPost
source: Edit Post
uk: Редагувати допис

# postDetailMenuDisableComments
source: Disable Comments
uk: Вимкнути коментарі

# postDetailMenuEnableComments
source: Enable Comments
uk: Увімкнути коментарі

# postDetailMenuDeletePost
source: Delete Post
uk: Видалити допис

# postDetailDeleteConfirmTitle
source: Delete Post?
uk: Видалити допис?

# postDetailDeleteConfirmMessage
source: Are you sure you want to delete this post? This action cannot be undone and will remove all associated comments and media.
uk: Ви впевнені, що хочете видалити цей допис? Цю дію неможливо буде скасувати, і вона видалить усі пов'язані коментарі та медіа.

# postDetailDeleteConfirmButtonCancel
source: Cancel
uk: Скасувати

# postDetailDeleteConfirmButtonDelete
source: Delete
uk: Видалити

# postDetailSnackbarErrorGeneric
source: Error: {errorDetails}
uk: Помилка: {errorDetails}

# postDetailSnackbarPostDeleted
source: Post "{postId}" has been deleted.
uk: Допис "{postId}" видалено.

# postDetailErrorPostNotFound
source: Post not found or could not be loaded.
uk: Допис не знайдено або не вдалося завантажити.

# postDetailLoading
source: Loading post details...
uk: Завантаження деталей допису...

# postDetailLikesSuffixSingular
source: Like
uk: Вподобайка

# postDetailLikesSuffixPlural
source: Likes
uk: Вподобайок

# postDetailCommentsSuffixSingular
source: Comment
uk: Коментар

# postDetailCommentsSuffixPlural
source: Comments
uk: Коментарів

# postDetailCommentsSectionTitle
source: Comments
uk: Коментарі

# postDetailCommentsDisabledMessage
source: Comments are disabled for this post.
uk: Коментарі до цього допису вимкнені.

# postDetailCommentsEmptyMessage
source: No comments yet. Be the first!
uk: Коментарів ще немає. Будьте першим!

# postDetailCommentInputHint
source: Write a comment...
uk: Написати коментар...

# postDetailButtonValidate
source: VALIDATE
uk: ПІДТВЕРДИТИ

# postDetailButtonDispute
source: DISPUTE
uk: ОСКАРЖИТИ

# recordStatusVerified
source: VERIFIED
uk: ПІДТВЕРДЖЕНО

# recordStatusRejected
source: REJECTED
uk: ВІДХИЛЕНО

# recordStatusExpired
source: EXPIRED
uk: ПРОСРОЧЕНО

# recordStatusPending
source: AWAITS VOTING
uk: ОЧІКУЄ ГОЛОСУВАННЯ

# recordStatusContested
source: CONTESTED
uk: ОСКАРЖЕНО

# recordStatusUnknown
source: UNKNOWN
uk: НЕВІДОМО

# postDetailButtonWatchProof
source: Watch Proof
uk: Дивитися доказ

# viewUserProfileAppBarTitleFallback
source: User Profile
uk: Профіль користувача

# viewUserProfileErrorNotAuth
source: User not authenticated.
uk: Користувач не автентифікований.

# viewUserProfileErrorLoadProfile
source: Could not load profile: {message}
uk: Не вдалося завантажити профіль: {message}
