Repository: levndays/muscle_up_android
Catalog: lib/l10n/app_*.arb
Languages: uk

# viewUserProfileErrorInit
source: Failed to initialize: {message}
uk: Не вдалося ініціалізувати: {message}

# viewUserProfileErrorFollowInvalidOp
source: Cannot follow/unfollow: Invalid operation.
uk: Не вдалося підписатися/відписатися: Недійсна операція.

# viewUserProfileErrorFollowGeneric
source: Failed to {action}: {errorDetails}
uk: Не вдалося {action}: {errorDetails}

# viewUserProfileErrorFollowActionFollow
source: follow
uk: підписатися

# viewUserProfileErrorFollowActionUnfollow
source: unfollow
uk: відписатися

# viewUserProfileErrorInvalidStateFollow
source: Cannot process follow/unfollow in current state: {currentState}
uk: Неможливо обробити підписку/відписку в поточному стані: {currentState}

# viewUserProfileStatLabelLevel
source: Level
uk: Рівень

# viewUserProfileButtonUnfollow
source: UNFOLLOW
uk: ВІДПИСАТИСЯ

# viewUserProfileButtonFollow
source: FOLLOW
uk: ПІДПИСАТИСЯ

# viewUserProfilePostsTitle
source: User's Posts
uk: Дописи користувача

# viewUserProfileNoPosts
source: Posts by @{username} will appear here.
uk: Дописи користувача @{username} з'являться тут.

# viewUserProfileErrorProfileNotAvailable
source: Profile not available.
uk: Профіль недоступний.

# commentListItemEditDialogTitle
source: Edit Comment
uk: Редагувати коментар

# commentListItemDeleteDialogTitle
source: Delete Comment?
uk: Видалити коментар?

# commentListItemEditDialogHint
source: Your comment...
uk: Ваш коментар...

# commentListItemDeleteDialogMessage
source: Are you sure you want to delete this comment? This action cannot be undone.
uk: Ви впевнені, що хочете видалити цей коментар? Цю дію неможливо буде скасувати.

# commentListItemDialogButtonCancel
source: Cancel
uk: Скасувати

# commentListItemDialogButtonSave
source: Save
uk: Зберегти

# commentListItemDialogButtonDelete
source: Delete
uk: Видалити

# commentListItemSnackbarDeleted
source: Comment deleted.
uk: Коментар видалено.

# commentListItemMenuEdit
source: Edit
uk: Редагувати

# commentListItemMenuDelete
source: Delete
uk: Видалити

# activeWorkoutAppBarTitleFallback
source: Active Workout
uk: Активне Тренування

# activeWorkoutDialogCancelTitle
source: Cancel Workout?
uk: Скасувати тренування?

# activeWorkoutDialogCompleteTitle
source: Complete Workout?
uk: Завершити тренування?

# activeWorkoutDialogCancelMessage
source: Are you sure you want to cancel this workout? Progress will not be saved.
uk: Ви впевнені, що хочете скасувати це тренування? Прогрес не буде збережено.

# activeWorkoutDialogCompleteMessage
source: Are you sure you want to finish and save this workout?
uk: Ви впевнені, що хочете завершити та зберегти це тренування?

# activeWorkoutDialogButtonNo
source: No
uk: Ні

# activeWorkoutDialogButtonYesCancel
source: Yes, Cancel
uk: Так, скасувати

# activeWorkoutDialogButtonNoContinue
source: No, Continue
uk: Ні, продовжити

# activeWorkoutDialogButtonYesComplete
source: Yes, Complete
uk: Так, завершити

# activeWorkoutLoading
source: Loading Workout...
uk: Завантаження тренування...

# activeWorkoutLoadingStartingNew
source: Starting new workout...
uk: Початок нового тренування...

# activeWorkoutNoneMessage
source: No active workout found.
uk: Активного тренування не знайдено.

# activeWorkoutButtonBackToRoutines
source: Back to Routines
uk: Назад до програм

# activeWorkoutErrorNoExercises
source: This workout has no exercises.
uk: Це тренування не містить вправ.

# activeWorkoutButtonAddFirstExercise
source: Add First Exercise
uk: Додати першу вправу

# activeWorkoutButtonFinishEmpty
source: Finish Empty Workout
uk: Завершити порожнє тренування

# activeWorkoutErrorExerciseNoSets
source: Error: Exercise ''{exerciseName}'' has no sets.
uk: Помилка: Вправа ''{exerciseName}'' не має підходів.

# activeWorkoutErrorExerciseNoSetsHelp
source: Please edit the routine or contact support.
uk: Будь ласка, відредагуйте програму або зверніться до підтримки.

# activeWorkoutButtonGoBack
source: Go Back
uk: Повернутися назад

# activeWorkoutErrorUnexpected
source: An unexpected state occurred. Please restart.
uk: Сталася неочікувана помилка. Будь ласка, перезапустіть.

# workoutCompleteTitleLevelUp
source: LEVEL UP!
uk: НОВИЙ РІВЕНЬ!

# workoutCompleteTitleDefault
source: Workout Complete!
uk: Тренування Завершено!

# workoutCompleteSubtitleLevelUp
source: You reached Level {level}!
uk: Ви досягли {level} рівня!

# workoutCompleteStatDuration
source: Duration: {durationMinutes} min
uk: Тривалість: {durationMinutes} хв

# workoutCompleteStatVolume
source: Total Volume: {volume} KG
uk: Загальний об'єм: {volume} КГ

# workoutCompleteStatXpGained
source: +{xpGained} XP GAINED
uk: +{xpGained} XP НАБУТО

# workoutCompleteXpBarLabelLevel
source: LVL {level}
uk: РІВ {level}

# workoutCompleteButtonAwesome
source: Awesome!
uk: Чудово!

# currentSetDisplayWeightDialogTitle
source: Set Weight (KG)
uk: Встановити вагу (КГ)

# currentSetDisplayWeightDialogHint
source: Enter weight
uk: Введіть вагу

# currentSetDisplayWeightDialogButtonCancel
source: Cancel
uk: Скасувати

# currentSetDisplayWeightDialogButtonSet
source: Set
uk: Встановити

# currentSetDisplaySetLabelPrefix
source: SET
uk: ПІДХІД

# currentSetDisplayWeightLabelPrefix
source: WEIGHT:
uk: ВАГА:

# currentSetDisplayUnitKgSuffix
source: KG
uk: КГ

# currentSetDisplayRepsLabelSuffix
source: REPETITIONS
uk: ПОВТОРЕНЬ

# currentSetDisplayRpeHelpText
source: Describe how hard it was to make a repetition on a 0-10 scale.
uk: Оцініть, наскільки важко було виконати повторення за шкалою від 0 до 10.

# currentSetDisplayNoRepsPlaceholder
source: Add reps
uk: Додайте повторення

# currentSetDisplayButtonPrevSet
source: < PREV. SET
uk: < ПОПЕРЕД. ПІДХІД

# currentSetDisplayButtonFinishWorkout
source: FINISH WORKOUT
uk: ЗАВЕРШИТИ ТРЕНУВАННЯ

# currentSetDisplayButtonNextExercise
source: NEXT EXERCISE >
uk: НАСТУПНА ВПРАВА >

# currentSetDisplayButtonNextSet
source: NEXT SET >
uk: НАСТУПНИЙ ПІДХІД >

# progressScreenLoadingData
source: Loading progress data...
uk: Завантаження даних прогресу...

# progressScreenRefreshingData
source: Refreshing progress data...
uk: Оновлення даних прогресу...

# progressScreenErrorNotAuthRefresh
source: User not authenticated. Cannot refresh.
uk: Користувач не автентифікований. Неможливо оновити.

# progressScreenErrorProfileNotFoundRefresh
source: User profile not found during refresh.
uk: Профіль користувача не знайдено під час оновлення.

# progressScreenErrorFailedRefresh
source: Failed to refresh data: {errorMessage}
uk: Не вдалося оновити дані: {errorMessage}

# progressScreenLoadingWorkoutStats
source: Loading workout stats...
uk: Завантаження статистики тренувань...

# progressScreenRefreshingWorkoutStats
source: Refreshing workout stats...
uk: Оновлення статистики тренувань...

# progressScreenErrorFailedProcessWorkoutData
source: Failed to process workout data: {errorMessage}
uk: Не вдалося обробити дані тренувань: {errorMessage}

# progressScreenXpToNextLevel
source: XP TO NEXT LEVEL!
uk: {xp} XP ДО НАСТУПНОГО РІВНЯ!

# progressScreenVolumeTitle
source: VOLUME (LAST 7 DAYS - SETS)
uk: ОБ'ЄМ (ОСТАННІ 7 ДНІВ - ПІДХОДИ)

# progressScreenNoVolumeData
source: No workout data for the last 7 days to display on muscle map.
uk: Немає даних про тренування за останні 7 днів для відображення на карті м'язів.

# progressScreenRpeTrendTitle
source: EXERTION (RPE TREND - LAST {maxWorkouts} WORKOUTS)
uk: СЕР. ВИСНАЖЕННЯ (ТРЕНД ЗА ОСТАННІ {maxWorkouts} ТРЕНУВАНЬ)

# progressScreenNoRpeData
source: No RPE data logged recently for any exercise.
uk: Останнім часом не було зареєстровано даних RPE для жодної вправи.

# progressScreenAvgRpeLabel
source: AVG. RPE -
uk: СЕР. RPE -

# progressScreenStrengthTrendTitle
source: STRENGTH (WEIGHT TREND - LAST {maxWorkouts} WORKOUTS)
uk: СИЛА (ТРЕНД ВАГИ - ОСТАННІ {maxWorkouts} ТРЕНУВАНЬ)

# progressScreenNoWeightData
source: No weight data logged recently for any exercise.
uk: Останнім часом не було зареєстровано даних про вагу для жодної вправи.

# progressScreenAvgWeightLabel
source: AVG. WEIGHT -
uk: СЕР. ВАГА -

# progressScreenAdviceTitle
source: ADVICE
uk: ПОРАДИ

# progressScreenNoAdvice
source: No new advice at the moment. Keep up the great work!
uk: Наразі нових порад немає. Продовжуйте в тому ж дусі!

# progressScreenErrorLoadAdvice
source: Error loading advice: {message}
uk: Помилка завантаження порад: {message}

# progressScreenLoadingAdvice
source: Loading advice...
uk: Завантаження порад...

# progressScreenButtonSendTestAdvice
source: Send Test Advice
uk: Надіслати тестові поради

# progressScreenButtonTryAgain
source: Try Again
uk: Спробувати ще

# progressScreenErrorLoadingProfile
source: Error loading profile: {errorMessage}
uk: Помилка завантаження профілю: {errorMessage}

# progressScreenNoData
source: No progress data available yet. Start working out!
uk: Даних про прогрес ще немає. Почніть тренуватися!

# progressScreenLevelLabel
source: LVL {level}
uk: РІВ {level}

# progressScreenExercisePlaceholder
source: EXERCISE {placeholder}
uk: ВПРАВА {placeholder}

# progressScreenKgUnit
source: KG
uk: КГ
